[
    {
        "url": "https://www.ynetnews.com/article/byyhjlinye",
        "title": "Yemen missile launch triggers sirens across central Israel for third straight day",
        "description": "Houthi terrorists launch third attack against Israel in three days; IDF intercepts missile outside airspace, causing flight delays and interceptor debris alerts",
        "content": "Air raid sirens blared across central Israel and the\n\nWest Bank\n\nlate Friday following a Houthi missile attack from Yemen, marking the terror group's third attack in three days. The IDF confirmed that a missile launched by the Houthis was intercepted outside Israeli airspace, and widespread alerts were triggered due to concerns over interceptor debris.\n\nNo injuries or damages were reported and the\n\nMagen David Adom\n\nemergency service reported no calls of incidents were received. Two flights heading to the country from Athens and Frankfurt were delayed clearing for landing at\n\nBen Gurion Airport\n\n.\n\nThe missile attack comes\n\none day after a previous one\n\nby the terror group on Thursday. The Houthis claimed responsibility for the attack, saying they had fired a 'Palestine 2' hypersonic ballistic missile at Ben Gurion Airport. Houthi spokesman Yahya Saree declared that \"the target was achieved\" and that the strike was a response to \"massacres against our brothers in the Gaza Strip.\"\n\nSeveral flights en route to Ben Gurion Airport, including an Etihad Airways flight from Abu Dhabi and an El Al flight from London, were briefly diverted but later cleared to land.\n\nGet the Ynetnews app on your smartphone: Google Play\n\n:\n\nhttps://bit.ly/4eJ37pE\n\n|\n\nApple App Store\n\n:\n\nhttps://bit.ly/3ZL7iNv\n\nThe missile strike occurred while\n\nFinance Minister Bezalel Smotrich\n\nwas delivering a speech in the Knesset ahead of a budget vote. As alerts appeared on TV screens, Knesset staff warned lawmakers of the missile attack.\n\nSmotrich, unaware of the unfolding situation, questioned, \"How is it that we can’t hear anything?\" before continuing his speech. Knesset protocol requires lawmakers to evacuate only if an alert is issued specifically for the parliament building.\n\nPrime Minister Benjamin Netanyahu\n\n, who was not in the Knesset chamber at the time, took shelter in a secure area. Speaking to Channel 14 after leaving his office, Netanyahu said, \"The Houthis are already paying — and they will pay more.\"\n\nThis marked the second Houthi missile attack on Israel in two days. On Tuesday, another 'Palestine 2' hypersonic missile was launched toward Be'er Sheva but was intercepted over Saudi Arabia by the Arrow air defense system. The Houthis claimed the attack was in response to Israeli military operations in Gaza and warned they would expand their list of targets if the fighting continued.\n\n<< Follow Ynetnews on\n\nFacebook\n\n|\n\nTwitter\n\n|\n\nInstagram\n\n|\n\nTelegram\n\n>>"
    },
    {
        "url": "https://www.ynetnews.com/article/bkhnvson1e",
        "title": "Israeli national killed in avalanche near France’s Villaroger ski resort",
        "description": "Local reports Israeli tourist's tragic death prompting embassy assistance as authorities warn of ongoing risks in the Grand Col area",
        "content": "An Israeli national was killed in an avalanche outside the Villaroger ski resort in\n\nFrance\n\n's Savoie region in the Alps, French media reported Friday evening.\n\n“The Israeli embassy in Paris and the department for Israelis abroad are handling a ski accident in France involving Israelis. The embassy and the department are in contact with local authorities to assist those involved,\" The\n\nForeign Ministry\n\nsaid in a statement without confirming the foreign report.\n\nAccording to French reports, the avalanche took place in the \"Grand Col\" area, outside the ski resort. The area remains at significant risk for further avalanches. AFP reported that units from the French gendarmerie’s mountain rescue team (PGHM) and an emergency medical service (SAMU) doctor were dispatched to the scene.\n\nGet the Ynetnews app on your smartphone: Google Play\n\n:\n\nhttps://bit.ly/4eJ37pE\n\n|\n\nApple App Store\n\n:\n\nhttps://bit.ly/3ZL7iNv\n\nVillaroger is a quaint mountain village in France's Savoie region, offering direct access to the expansive Les Arcs ski area, which boasts 200 kilometers (124 miles) of pistes. Despite its proximity to renowned resorts like Val d'Isere and Tignes, Villaroger provides a tranquil alternative for skiers seeking a peaceful retreat.\n\nThe village maintains its rustic charm with traditional chalets and forested surroundings. Notably, it features one of Europe's longest ski runs — a 7-kilometer (4.3 miles) descent with a 2,000-meter (6,562 feet) vertical drop from the Aiguille Rouge summit to Villaroger.\n\n<< Follow Ynetnews on\n\nFacebook\n\n|\n\nTwitter\n\n|\n\nInstagram\n\n|\n\nTelegram\n\n>>"
    },
    {
        "url": "https://www.ynetnews.com/article/sjhfxbjnyl",
        "title": "44 former hostages demand Gaza ceasefire to free remaining captives",
        "description": "Freed Israelis call on government to halt Gaza war, warning that military escalation risks further hostage deaths and demanding immediate negotiations for a comprehensive deal",
        "content": "Forty-four former hostages and over 250 relatives of captives have signed a letter demanding the government halt the fighting in Gaza,\n\nresume negotiations and secure the release of all individuals\n\nstill being held by Hamas.\n\n\"Stop the fighting, return to the negotiating table and finalize a deal that brings back all the hostages — even at the cost of ending the war. Military pressure endangers them and nothing is more urgent than their return,\" the letter read.\n\nThe signatories, including former hostages, warned that\n\nongoing military operations\n\nput the captives at risk. \"This letter was written in blood and tears. Our friends, families of those killed and murdered in captivity, are crying out: stop the fighting, return to negotiations and finalize a deal to bring back all the hostages — even if it means ending the war. Military pressure endangers them, and nothing is more urgent than bringing them home,\" they wrote.\n\n\"We all stand together — those who survived captivity and endured its horrors, the families of hostages still in Gaza living in terror, those who embraced their loved ones upon their return, and those who buried them knowing they could have been saved. Together, we say: enough!\n\nGet the Ynetnews app on your smartphone: Google Play\n\n:\n\nhttps://bit.ly/4eJ37pE\n\n|\n\nApple App Store\n\n:\n\nhttps://bit.ly/3ZL7iNv\n\n“Military pressure kills living hostages and erases the missing. This isn’t a slogan; it’s reality. Forty-one hostages have already paid with their lives — we, their families, have paid as well. They could have returned to our embrace and to recovery but now they never will.\"\n\nThe letter accuses the government of prioritizing an \"endless war\" over rescuing the hostages. \"This is a criminal policy — you have no mandate to sacrifice 59 more captives. We, the families who have unwillingly and against our will borne the heaviest price, raise a red flag in warning: resuming the fighting will cost more hostages their lives and risks creating more Ron Arads. The circle of grief will only grow — for nothing.\"\n\nConcluding their appeal, they urged, \"The fighting must stop and immediate negotiations must begin to reach a comprehensive agreement: all the hostages in exchange for ending the war and finding a solution for post-war Gaza. If you don’t act, the next hostage’s blood — and the fate of them all — will be on your hands.\"\n\nThe signatories include:\n\nGadi Mozes\n\n,\n\nOhad Ben Ami\n\n, Raz Ben Ami,\n\nKeith Siegel\n\n,\n\nOfer Calderon\n\n, Sahar Calderon, Erez Calderon,\n\nEliya Cohen\n\n,\n\nLiri Albag\n\n,\n\nSagui Dekel-Chen\n\n, Agam Berger, Karina Ariev, Arbel Yehud, Ada Sagi, Shani Goren, Nili Margalit, Gabriela Leimberg, Fernando Marman, Clara Marman, Yaffa Adar, Ditza Heyman, Ofir Engel, Amit Soussana, Keren Munder, Ruti Munder, Liam Or, Adina Moshe, Channah Peri, Raaya Rotem, Liat Atzili, Noga Weiss, Shiri Weiss, Margalit Mozes, Rimon Buchstab-Kirscht, Sharon Aloni Cunio, Daniel Aloni, Ilana Gritzewsky, Karina Engel-Bart, Norlin Babdila, Meirav Tal, Gelienor “Jimmy” Leano Pacheco, Shoshan Haran and Ofelia Whitman.\n\n<< Follow Ynetnews on\n\nFacebook\n\n|\n\nTwitter\n\n|\n\nInstagram\n\n|\n\nTelegram\n\n>>"
    },
    {
        "url": "https://www.ynetnews.com/article/r1moi4o2kx",
        "title": "Report: Hamas reviewing Egypt's US-backed bridge proposal for hostage deal",
        "description": "Cairo seeks to revive stalled Gaza hostage negotiations while Israeli officials claim no such initiative is known about; discussions continue amid resumed fighting in the Strip",
        "content": "A Palestinian official told Reuters on Friday that Egypt has proposed a mediation plan to revive the\n\nhostage deal\n\n, but\n\nHamas\n\nhas yet to respond. The official declined to share details, saying the proposal is still under review.\n\nTwo Egyptian security sources said Cairo suggested setting a timeline for releasing the remaining hostages alongside a final date for a full Israeli withdrawal from Gaza, with U.S. guarantees. They noted that Washington signaled initial approval, while Israeli officials said they haven't received any U.S.-backed mediation proposal.\n\n\"Communication channels with the mediators remain open,” An Israeli official said. “No Egyptian mediation proposal has been presented to us. We’re not aware of such a proposal.\"\n\nMeanwhile, Israel’s Security Cabinet is set to convene Saturday evening to approve\n\nDefense Minister Israel Katz\n\n’s proposal to establish an administration within the Defense Ministry to coordinate government efforts for the\n\n\"voluntary relocation\" of Gazans to other countries\n\n.\n\nIf approved, the administration would oversee cooperation between government ministries, the military, Shin Bet and police.\n\nSecurity sources claimed that surveys conducted among Gaza residents indicate that about 50% wish to leave, with approximately 90% of those with higher education expressing a desire to emigrate if given the opportunity.\n\nGet the Ynetnews app on your smartphone: Google Play\n\n:\n\nhttps://bit.ly/4eJ37pE\n\n|\n\nApple App Store\n\n:\n\nhttps://bit.ly/3ZL7iNv\n\nTwo days ago, Katz published a direct message to Gazans, which was posted on the\n\nCoordinator of Government Activities in the Territories' (COGAT\n\n) page and sparked online discussion. \"Population evacuation will begin soon,\" Katz told Gazans, urging them to \"expel Hamas.\"\n\nWithin hours, the video, published in Hebrew, received over 100,000 views and more than 350 comments. Many commenters, including anonymous users, expressed a desire to leave Gaza amid the renewed fighting, with some calling for an immediate opening of border crossings. Most comments distanced themselves from Hamas, with users saying they, too, suffer under its rule.\n\nIf approved, Katz’s proposed administration would coordinate with international organizations and other entities as directed by the government. It would include representatives from the justice, foreign, interior, finance, transportation and strategic affairs ministries, as well as officials from the IDF, COGAT, Shin Bet, National Security Council, Mossad and Israel Police.\n\nAccording to the proposal, the administration would work with various entities to facilitate a safe and controlled departure of Palestinians from Israel to third countries. It would oversee security arrangements, establish designated pedestrian crossings in Gaza and coordinate infrastructure for land, sea and air travel to destination countries.\n\n<< Follow Ynetnews on\n\nFacebook\n\n|\n\nTwitter\n\n|\n\nInstagram\n\n|\n\nTelegram\n\n>>"
    },
    {
        "url": "https://www.ynetnews.com/article/rjzeymsn1l",
        "title": "Hersh Goldberg-Polin’s father slams Israel’s 'failed' hostage deal, defends Shin Bet chief Bar",
        "description": "John Polin condemns Israel’s insufficient negotiation mandate for hostage releases, protests Shin Bet chief Ronen Bar's impending ouster",
        "content": "John Polin, the father of hostage\n\nHersh Goldberg-Polin who was murdered in Hamas captivity\n\n, wrote on Friday that he hopes \"the true story of the failed hostage release negotiations will one day be revealed. I continue to believe that the government never gave the Israeli negotiating team a broad and serious enough mandate.\"\n\nIn a Facebook post, he thanked\n\nShin Bet chief Ronen Bar\n\n: \"Some members of the Israeli negotiation team pushed hard, but unsuccessfully, for a broader mandate. Thank you, Ronen Bar, for being one of those who did so.\"\n\nGoldberg-Polin was\n\nmurdered by Hamas terrorists last August along with five other hostages\n\n. He was abducted from the \"Death Shelter\" after attending the Nova music festival in Re’im. Hamas terrorists filmed him being led, wounded, to their truck—likely injured by a grenade they threw into the shelter.\n\nPolin’s remarks come amid the\n\ncontroversy surrounding Bar's dismissal\n\n. In a scathing letter to the government, Bar addressed the circumstances of his removal: \"The resolution proposal implies a supposed lack of trust between the prime minister and me over the handling of the hostage release efforts,\" he wrote.\n\nGet the Ynetnews app on your smartphone: Google Play\n\n:\n\nhttps://bit.ly/4eJ37pE\n\n|\n\nApple App Store\n\n:\n\nhttps://bit.ly/3ZL7iNv\n\n\"The recent hostage deal materialized due to a unique effort personally led by me, with the prime minister’s knowledge,\" he added. \"The deal was achieved according to the objectives he set, was brought by him for government approval and was endorsed with his support,\" he added.\n\n\"Given this, the claim of a supposed lack of trust has no basis — unless the real intent, which I may have failed to grasp, was to negotiate without reaching a deal.\"\n\nBar also said that sidelining both him and the\n\nMossad chief David Barnea\n\nfrom the negotiations \"harmed the team and did nothing to advance the hostages' release. Therefore, the prime minister’s claim in this regard is baseless.\"\n\nHe reaffirmed his commitment to bringing all hostages, both living and deceased, back to Israel, emphasizing that \"this is especially critical in the current window of opportunity.\"\n\n<< Follow Ynetnews on\n\nFacebook\n\n|\n\nTwitter\n\n|\n\nInstagram\n\n|\n\nTelegram\n\n>>"
    },
    {
        "url": "https://www.ynetnews.com/article/bytkgminkl",
        "title": "IDF eliminates Hamas intelligence chief Osama Tabash in southern Gaza strike",
        "description": "Military reports death of one of the key architects of the October 7 massacre as renewed fighting intensifies in Gaza amid stalled hostage negotiations",
        "content": "The\n\nIDF\n\nSpokesperson's Unit on Friday reported the military eliminated Osama Tabash, the head of\n\nHamas\n\n' Military Intelligence in southern Gaza, in an intelligence-based strike on Thursday.\n\nAccording to the announcement, Tabash also led Hamas' Surveillance and Targeting Unit, which is responsible for gathering visual intelligence and generating targets for Hamas in both Israeli territory and the Gaza Strip.\n\n\"Tabash was a senior Hamas terrorist and was a significant source of operational knowledge for the terrorist organization,\" the IDF said in a statement, adding that he had held various key positions, including battalion commander in\n\nHamas' Khan Younis Brigade\n\n.\n\nOver the years, he was involved in terrorist activities and attacks, including a 2005 suicide bombing at the Gush Katif junction that killed ISA coordinator Oded Sharon.\n\nGet the Ynetnews app on your smartphone: Google Play\n\n:\n\nhttps://bit.ly/4eJ37pE\n\n|\n\nApple App Store\n\n:\n\nhttps://bit.ly/3ZL7iNv\n\nThe IDF added Tabash played a central role in formulating Hamas' combat strategy on the ground, coordinating intelligence efforts in southern Gaza and leading military operations in the area. Over the past year, he was involved in rebuilding Hamas' military capabilities after sustaining losses during the war.\n\nThe military further said that Tabash was directly responsible for planning and coordinating targets and infiltration objectives during\n\nHamas' October 7 massacre\n\nin Israeli communities near the border.\n\n\"Throughout the war, he also led Hamas' Surveillance Unit, which gathered intelligence and monitored IDF operations, directed attacks at IDF troops, and played a key role in shaping Hamas' perception of the IDF and its activities,\" the announcement read.\n\nThe IDF stressed that his elimination significantly weakened Hamas' intelligence-gathering abilities and its efforts to target Israeli forces in Gaza.\n\nThe military report comes amid renewed fighting in Gaza following the\n\ncollapse of the ceasefire between Israel and Hamas\n\nfollowing the terror group's refusal to release Israeli hostages.\n\n<< Follow Ynetnews on\n\nFacebook\n\n|\n\nTwitter\n\n|\n\nInstagram\n\n|\n\nTelegram\n\n>>"
    },
    {
        "url": "https://www.ynetnews.com/article/sjohjljnke#autoplay",
        "title": "IDF intercepts Gaza rockets over Ashkelon amid renewed fire",
        "description": "Military counters at least two projectiles with no casualties amid renewed fighting in Gaza; Katz directs territorial expansions to pressure hostage releases and strengthen buffer zones",
        "content": "Air raid sirens sounded in southern Israel's\n\nAshkelon\n\nFriday, following the launch of two projectiles from northern Gaza, the IDF Spokesperson's Unit confirmed.\n\nAccording to the military, the rockets were intercepted by the\n\nIsraeli Air Force (IAF)\n\n. “Following the sirens that sounded at 04:30 p.m. in Ashkelon, two projectiles that were fired from northern Gaza were intercepted by the IAF,” the IDF said in a statement.\n\nNo injuries or damage were reported. Magen David Adom (MDA) confirmed there were no casualty reports in the area at the time of writing. The alerts marked the latest in a series of exchanges between Israel and Hamas following the\n\ncollapse of the ceasefire agreement\n\n.\n\nMeanwhile,\n\nDefense Minister Israel Katz\n\n\n\nannounced that he has instructed the IDF to seize additional territory in Gaza\n\nand expand security buffer zones surrounding the enclave, warning that continued refusal by Hamas to release hostages will result in the loss of more land “to be annexed by Israel.”\n\nKatz said the IDF has been instructed to evacuate civilians from targeted areas and establish long-term Israeli control. “The more Hamas persists in its refusal to release the hostages, the more territory it will lose,” he declared. “I have directed the IDF to expand the maneuver, take control of more ground and hold it permanently to protect Israeli communities and soldiers.”\n\nGet the Ynetnews app on your smartphone: Google Play\n\n:\n\nhttps://bit.ly/4eJ37pE\n\n|\n\nApple App Store\n\n:\n\nhttps://bit.ly/3ZL7iNv\n\n<< Follow Ynetnews on\n\nFacebook\n\n|\n\nTwitter\n\n|\n\nInstagram\n\n|\n\nTelegram\n\n>>"
    },
    {
        "url": "https://www.ynetnews.com/article/bjrx11c931x",
        "title": "Top court freezes dismissal of Shin Bet chief Ronen Bar",
        "description": "High Court of Justice issues injunction on ouster of secret service head, hours after Netanyahu signaled he would not honor such ruling; decision triggers backlash from senior officials, deepening tensions between judiciary and government ahead of April 8 hearing on case",
        "content": "The High Court of Justice issued an injunction Friday freezing the dismissal of Shin Bet director Ronen Bar, just hours after Prime Minister Benjamin Netanyahu publicly indicated he would not honor a ruling blocking the move.\n\nJustice Gila Canfy-Steinitz ruled that Bar’s ouster,\n\napproved unanimously by the Cabinet hours earlier\n\n, would be suspended pending further legal proceedings. A hearing on the petitions against the dismissal will be held no later than April 8, with government responses due by March 24.\n\n“Without taking a stance on the petitions, and to prevent an irreversible situation, a temporary order is issued suspending the government’s decision until further notice,” the judge wrote.\n\nBar was scheduled to end his term on April 10 or upon the appointment of a permanent replacement, whichever came first.\n\n<< Get the Ynetnews app on your smartphone: Google Play\n\n:\n\nhttps://bit.ly/4eJ37pE\n\n|\n\nApple App Store\n\n:\n\nhttps://bit.ly/3ZL7iNv\n\n>>\n\nThe decision sparked sharp backlash from senior officials. Communications Minister Shlomo Karhi lashed out at the court, saying, “You have no legal authority to interfere. This is the government’s domain alone. Your order is invalid. The people are sovereign.”\n\nThe ruling came shortly after new quotes emerged from Thursday night’s Cabinet meeting in which Netanyahu reportedly told ministers: “Can anyone imagine continuing to work without trust due to a court order? That can’t happen—and it won’t happen.”\n\nBar did not attend the Cabinet meeting but issued a detailed letter rejecting the legal and professional basis for his dismissal, framing it as a politically motivated maneuver aimed at undermining the Shin Bet’s independence and ongoing investigations, including a sensitive probe involving\n\nalleged ties between staff in Netanyahu's office and the Qatari government\n\n.\n\nIn his letter, Bar wrote that the Cabinet session “was convened hastily and in violation of basic legal principles, particularly the right to a hearing.” He added that the accusations in the dismissal proposal were vague, baseless and lacked substantiation, despite his request for concrete examples in a prior conversation with the prime minister.\n\nA senior political source, echoing conspiracy theories, accused Bar of avoiding the Cabinet meeting out of fear of being questioned over claims that he had advance knowledge of\n\nHamas\n\n’\n\nOctober 7\n\nattack but failed to act or inform Netanyahu.\n\nBar strongly denied the suggestion. “The call for an independent and thorough investigation into October 7, and related issues, is a duty—not disloyalty,” he wrote. “Efforts to obstruct such a probe for personal or political gain pose a direct threat to Israel’s security.”\n\nBar also defended his handling of hostage negotiations, noting that the most recent deal was personally led by him, coordinated with Netanyahu and approved by the Cabinet. He dismissed the prime minister’s accusations of “soft handling” and “weak negotiation tactics,” suggesting the criticism stemmed from internal political motivations.\n\nNetanyahu, in turn, accused Bar of politicizing the Shin Bet and opposing Cabinet positions in public forums. “He dragged the agency into political arguments,” the prime minister reportedly told ministers. “I need someone I can look in the eye and trust without hesitation when approving sensitive operations.”\n\nThe prime minister said that he had replaced Bar as head of the negotiation team in January, assigning the role to his deputy. “Since then, leaks have diminished and we succeeded in bringing hostages home,” he said, though Bar noted that the key deal had already been finalized before the leadership change.\n\nBar’s letter suggested that his dismissal may be linked to ongoing sensitive investigations into “Qatar-Gate,” a probe into alleged foreign influence within the Prime Minister’s Office. “A rushed attempt to remove me, backed by unfounded claims and clear conflicts of interest, directly endangers the Shin Bet’s ability to function professionally and threatens Israel’s national security,” he wrote.\n\nWhile Netanyahu has avoided publicly referencing the Qatar investigation, his office has repeatedly criticized the Shin Bet’s involvement in the probe, calling it “scandalous” and claiming it was aimed at avoiding accountability for the intelligence failures of October 7.\n\n<< Follow Ynetnews on\n\nFacebook\n\n|\n\nTwitter\n\n|\n\nInstagram\n\n|\n\nTelegram\n\n>>"
    },
    {
        "url": "https://www.ynetnews.com/article/sycwshqnje#autoplay",
        "title": "Katz orders expansion of Gaza ground operations, warns Hamas will ‘lose more territory’",
        "description": "Defense minister orders IDF to seize more Gaza territory and expand buffer zones, warning terror group will lose land if hostages aren't freed; move comes as Hamas accuses Netanyahu of sabotaging talks, citing remarks by outgoing Shin Bet chief Bar",
        "content": "Defense Minister\n\nIsrael Katz\n\nannounced Friday that he has instructed the\n\nIDF\n\nto\n\nseize additional territory in Gaza\n\nand expand security buffer zones surrounding the enclave, warning that continued refusal by\n\nHamas\n\nto release hostages will result in the loss of more land “to be annexed by Israel.”\n\nKatz said the IDF has been instructed to evacuate civilians from targeted areas and establish long-term Israeli control. “The more Hamas persists in its refusal to release the hostages, the more territory it will lose,” he declared. “I have directed the IDF to expand the maneuver, take control of more ground and hold it permanently to protect Israeli communities and soldiers.”\n\nThe minister affirmed Israel’s commitment to the U.S. hostage deal proposal put forward by President\n\nDonald Trump\n\n’s Middle East envoy\n\nSteve Witkoff\n\n. The plan calls for the release of all hostages—both living and deceased—in two phases, separated by a temporary ceasefire. “We are fully committed to this proposal, which does not compromise Israel’s security interests,” Katz said.\n\nIn the absence of progress, Katz warned of intensified military pressure. “We will escalate our campaign—by air, sea and ground—until the hostages are freed and Hamas is defeated,” he said, vowing to use “all military and civilian means of pressure.”\n\nThe defense minister also referenced former\n\nTrump’s previously floated plan for “voluntary relocation” of Gaza residents\n\n, saying Israel would implement population transfers southward in line with that vision, without elaborating further.\n\n<< Get the Ynetnews app on your smartphone: Google Play\n\n:\n\nhttps://bit.ly/4eJ37pE\n\n|\n\nApple App Store\n\n:\n\nhttps://bit.ly/3ZL7iNv\n\n>>\n\nThe announcement came as tensions over the hostage negotiations deepened. On Friday, Hamas released a strongly worded statement accusing Prime Minister\n\nBenjamin Netanyahu\n\nof sabotaging efforts to reach a deal. The group claimed that comments made by outgoing Shin Bet chief Ronen Bar reveal “Netanyahu’s deliberate manipulation of the negotiation process” for political purposes and “his efforts to derail agreements after they were already within reach.”\n\nBar,\n\ndismissed by the government early Friday\n\n, wrote in a letter to ministers that the recent hostage deal was \"personally led by me, with the knowledge of the prime minister,\" and approved by Netanyahu and the Cabinet. He rejected Netanyahu's claim of a breakdown in trust, writing: “There is no basis for claims of mistrust, unless the true intention—apparently misunderstood by me—was to hold talks without actually reaching an agreement.”\n\nHamas seized on Bar’s remarks, accusing Netanyahu of being “the real obstacle” to any deal. “His efforts to remove key security officials from the talks reflect his internal political crisis and growing distrust between him and Israel’s security establishment,” Hamas said in its statement. “This confirms that Netanyahu engineered the talks as a time-wasting maneuver, with no intention of achieving tangible results.”\n\nThe group also sought to drive a wedge between Jerusalem and Washington, calling on U.S. officials to “stop blaming Hamas for failed agreements” and to “hold Netanyahu accountable for the ongoing suffering of the hostages and their families.”\n\n<< Follow Ynetnews on\n\nFacebook\n\n|\n\nTwitter\n\n|\n\nInstagram\n\n|\n\nTelegram\n\n>>"
    },
    {
        "url": "https://www.ynetnews.com/article/hyzhaj52jx",
        "title": "Cabinet to discuss no-confidence motion against attorney general amid deepening political rift",
        "description": "Justice Minister Yariv Levin set to bring no-confidence motion against Gali Baharav-Miara, accusing her of political bias and obstructing government work; move could lead to her dismissal pending lengthy review process",
        "content": "One day after the\n\ngovernment approved the dismissal of Shin Bet chief Ronen Bar\n\n, a new political showdown is brewing. Justice Minister\n\nYariv Levin\n\nis set to\n\nintroduce a no-confidence motion against Attorney General Gali Baharav-Miara\n\nat Sunday’s Cabinet meeting, intensifying the Netanyahu government’s efforts to reshape key legal institutions.\n\nAccording to the official agenda distributed to ministers, the government will be asked to express no confidence in Baharav-Miara, citing what the proposal calls her \"inappropriate conduct\" and \"ongoing fundamental disagreements\" that allegedly prevent effective cooperation between the executive and legal branches.\n\nA detailed 83-page annex attached to the proposal includes a letter Levin circulated earlier this month accusing Baharav-Miara of serving as “an extended arm of the opposition” from the first day of the current government. Levin has been publicly critical of Israel's legal framework, describing the attorney general’s powers as extraordinary compared to other democracies.\n\nLevin wrote that the position of attorney general in Israel—while not a political appointment—is endowed with extensive authority that, in his view, has turned the role into one of “unprecedented power and political interference.”\n\nIn sharp language, Levin claimed Baharav-Miara had created a “tyrannical, at times aggressive and destructive political force” within the government and used her position to advance political agendas under the guise of legal professionalism. He accused her of operating with bias, exploiting political divisions and undermining public trust in the legal system. Her tenure, he wrote, \"will be remembered as a stain\" on the office.\n\nThe Cabinet vote marks only the first stage in a lengthy process that could lead to Baharav-Miara’s removal. Should the motion pass, the issue will move to the official search and review committee for the attorney general position, currently chaired by former Supreme Court Chief Justice Asher Grunis, who initially opposed her appointment. Other members include Bar Association representative Tami Ullman and law professor Ron Shapira. Levin is expected to add a coalition-aligned former justice minister to the committee.\n\nThe committee would review cases in which Baharav-Miara declined to represent ministers before the High Court of Justice or blocked actions she deemed illegal. She would also be summoned to testify and present her defense. While the committee’s recommendation is influential, the government is not legally bound by it. Ultimately, the High Court of Justice is expected to have the final say.\n\nFormer Likud minister Moshe Nissim told Ynet's sister publication Yedioth Ahronoth that he would not serve on the committee, despite reports that Levin approached him. “I will not be part of the committee, period,” he said, refusing to elaborate further.\n\nIn a rare and united response, all former attorneys general—including\n\nAharon Barak\n\n, Yehuda Weinstein,\n\nAvichai Mandelblit\n\nand others—issued a joint statement warning that dismissing Baharav-Miara would cause severe harm to the independence of the office and the rule of law in Israel.\n\n“We are deeply concerned and strongly oppose this move,” the former officials wrote. “The attorney general’s role is not only to advise the government within the law, but to act as the public’s primary guardian of the rule of law and democratic values.” They praised Baharav-Miara for performing her duties \"with courage and impartiality\" and warned that the government’s refusal to follow legal guidance does not justify her removal.\n\n“There is no legal basis for this move,” they concluded. “Her dismissal would severely damage the attorney general’s independence and the legal system’s ability to uphold the rule of law.”\n\n<< Follow Ynetnews on\n\nFacebook\n\n|\n\nTwitter\n\n|\n\nInstagram\n\n|\n\nTelegram\n\n>>"
    }
]