[
    {
        "url": "https://www.ynetnews.com/article/rkyhln7t1l",
        "title": "Islamic Jihad resumes rocket fire from Gaza, and is coordinating with Hamas",
        "description": "The second most important group in the Gaza Strip claimed responsibility for four rocket launches toward the Gaza periphery in two days",
        "content": "The\n\nIslamic Jihad\n\nmovement has resumed rocket fire into\n\nIsrael\n\nfrom\n\nGaza\n\n, following an Israeli airstrike last week that targeted the group’s senior officials,\n\nincluding Abu Hamza, the spokesman and rocket commander\n\n. The strike, which took place in the Nusseirat area of central Gaza, significantly weakened the organization, but it has since returned to active operations.\n\nSince Israel resumed airstrikes in Gaza, Islamic Jihad has launched rockets towards Israel, primarily targeting the Gaza periphery. This contrasts with Hamas, which has fired rockets into areas such as the Gush Dan region. While Hamas has claimed responsibility for the deadly attack on October 7, Islamic Jihad was also involved in the assault on the Gaza periphery.\n\nIsraeli forces had previously separated the two groups, avoiding direct strikes on Hamas while targeting Islamic Jihad in several operations. The Islamic Jihad group also has been implicated in abducting and holding Israeli hostages, with conditions differing from those in Hamas-controlled areas.\n\nA source close to the group in Gaza explained that, while Islamic Jihad had suffered substantial losses, it has continued to recruit fighters and maintain its operations, especially in the northern Gaza Strip. The group has several weapons and rocket laboratories in the area.\n\nOn Monday, the group claimed responsibility for rocket fire toward the Hatzor military base and the Gaza perimeter. This follows previous rocket attacks targeting Sderot, Zikim and Netiv HaAsara. The group has maintained coordination with Hamas in launching rockets and has no intention of halting its activities as long as Israel continues its strikes.\n\nDespite its reduced strength, Islamic Jihad’s military capabilities remain intact, as evidenced by the recent hostage release ceremonies. Senior figures from both Hamas and Islamic Jihad participated in these events, and meetings between their leaders have been frequent.\n\n:\n\n|\n\n:\n\nThe group's leadership includes senior figures such as Ziad al-Nakhala, who left Syria after the fall of Bashar Assad’s regime, and Khaled al-Batsh, who has evaded Israeli security forces since last year. Other prominent members include Muhammad al-Hindi and Ahmed al-Modallal. Before the war, the group relied heavily on smuggling through tunnels or crossings, but now it focuses more on local production of rockets and explosives in Gaza, particularly in the northern region.\n\n|\n\n|\n\n|\n\n>>",
        "main_image": {
            "original_url": "https://ynet-pic1.yit.co.il/cdn-cgi/image/format=auto/picserver6/crop_images/2023/10/04/S18frKGoxT/S18frKGoxT_0_50_3000_1688_0_x-large.jpg",
            "local_path": "/article-images/islamic-jihad-resumes-rocket-fire-from-gaza-and-is.jpg"
        },
        "content_images": []
    },
    {
        "url": "https://www.ynetnews.com/article/r1cb00bmpkg",
        "title": "Netanyahu flight to Washington rerouted over fear of arrest in Europe, envoy to US says",
        "description": "Israel's ambassador to the US, Yehiel Leiter, says that due to the prime minister’s medical condition during his last trip to the US and concerns about a possible emergency landing, 'Wing of Zion' flew over US military bases since Netanyahu could not land 'anywhere in Europe' without being arrested  ",
        "content": "Israel's ambassador to the United States, Yehiel Leiter, confirmed Thursday that\n\nPrime Minister Benjamin Netanyahu’s\n\nflight route to the\n\nU.S.\n\nlast month was altered due to the International Criminal Court’s (ICC) arrest warrant against him.\n\n“When the prime minister arrived here last month, he had to fly for 13 and a half hours instead of the usual 12,” Leiter said. “People don’t know this, but the reason was that he couldn’t land anywhere in Europe.”\n\nSpeaking in an online meeting with members of the U.S.-based One Israel Fund, Leiter explained that Netanyahu, who had undergone surgery shortly before the trip, was accompanied by two doctors who warned he might need to make an emergency landing. “But if he had landed in Europe, he could have been arrested as a war criminal. So he had to fly over U.S. military bases for 13 and a half hours,” he said.\n\nLeiter also discussed efforts to convince the Biden administration to take action against antisemitism in Europe.\n\n“You cannot fight antisemitism if the world’s number one Jew is branded a war criminal,” he said. “As I told Senate leadership, if you’re fighting antisemitism, the first thing you need to do is remove this mark of Cain from the prime minister’s forehead. Because if he’s a child murderer, then we all are, and we deserve the hatred.”\n\nHe added that the U.S. administration has shown a “commitment to helping us and ensuring that no international body undermines our right to defend ourselves,” including diplomatic efforts to prevent unilateral moves against Israel by European countries.\n\nLeiter also revealed he met Thursday morning with Leo Terrell, the U.S. special envoy to combat antisemitism, and Danny Naveh, president of Israel Bonds, to address growing pressure on U.S. cities and municipalities to divest from Israel-related investments amid calls from the Boycott, Divestment and Sanctions (BDS) movement. Several local governments in the U.S. have already announced they will halt investments in Israeli bonds since the start of the war, he said. Terrell, who is currently focused on combating antisemitism on college campuses, is expected to take up the issue.\n\n“He’s starting with universities, but I wanted him to understand that this goes beyond campuses — especially when it comes to Israel bonds at the state and municipal level,” Leiter said. “We provided him with extensive documentation on anti-Israel activists, and he’s addressing it.”\n\n:\n\n|\n\n:\n\nLeiter also criticized the partial arms embargo imposed on Israel by the Biden administration, which included a delay in shipments of heavy bombs and D-9 bulldozers, saying that since the change in U.S. leadership, Israel has been at “the forefront of American foreign policy.”\n\n“Everyone knows about the embargo that froze heavy bombs, but the fact is that billions of dollars in weapons Israel had already purchased were also delayed,” he said. “President Trump immediately signed an executive order to release this ammunition. It took some time to get it through because of bureaucracy, but this was one of my top priorities since arriving here — to get it all back on track.”\n\n|\n\n|\n\n|\n\n>>",
        "main_image": {
            "original_url": "https://ynet-pic1.yit.co.il/cdn-cgi/image/format=auto/picserver6/crop_images/2025/02/04/SyAavZlKkx/SyAavZlKkx_0_0_3000_1688_0_x-large.jpg",
            "local_path": "/article-images/netanyahu-flight-to-washington-rerouted-over-fear-.jpg"
        },
        "content_images": []
    },
    {
        "url": "https://www.ynetnews.com/article/syu3vx7aje",
        "title": "House Republicans claim Biden used funding to 'undermine' Netanyahu government",
        "description": "Six Israeli and American nonprofits have been ordered to report on how they used funds they received from the Biden administration during protests against plans for legal reform; 'USAID and the State Department provided direct support to Hamas,' the lawmakers claim ",
        "content": "The U.S. House Judiciary and Foreign Affairs committees have launched an investigation into six Israeli and American organizations that received federal funding during the Biden administration. Lawmakers aim to determine whether the funds were used to \"undermine the standing of Israeli Prime Minister Benjamin Netanyahu\" amid the 2023 protests against the judicial overhaul.\n\nIn a letter sent to the organizations, Republican Reps. Jim Jordan, chair of the Judiciary Committee, and Brian Mast, chair of the Foreign Affairs Committee, accused the Biden administration of using government funding to \"harm Israel’s democratically elected government.\" The letter was sent to six groups, including the Movement for Quality Government in Israel, Blue and White Future, the Jewish Communal Fund (JCF), the Israel Policy Forum (PEF), Rockefeller Philanthropy Advisors, and the Middle East Peace Dialogue Network (MEPDN).\n\nAs part of the inquiry, the committees have requested documents and correspondence related to funding applications and expenditures by April 9. They also instructed the organizations to preserve all data related to the grants they received. The letter, first reported by Jewish Insider, claims that the case highlights \"a problematic track record of USAID and the State Department in funding actors in the region,\" referencing allegations that millions of dollars have been directed to groups linked to terrorism and antisemitic rhetoric.\n\nThe U.S. Agency for International Development (USAID), an independent agency created by congressional mandate, is currently facing potential dissolution. Former President Donald Trump previously described USAID as \"run by a bunch of radical lunatics, and we’re getting rid of them.\" Critics have warned that shifting its responsibilities to the State Department could allow presidents to use humanitarian aid as a political tool and undermine long-term development projects. They also argue that such a move could create a vacuum, enabling greater influence from Russia, China, Iran, and their proxies in aid-dependent regions.\n\n:\n\n|\n\n:\n\n\"According to reports, the Biden-Harris administration directed American taxpayer money to certain Israeli entities in a manner intended to undermine Israel’s democratically elected government,\" the Republican lawmakers wrote. \"The use of federal grants in this way not only jeopardizes the U.S.-Israel relationship but also violates basic civil rights protections in both countries. Furthermore, the misuse of federal grant money could, in some cases, constitute a criminal offense. As part of our constitutional oversight responsibilities, we seek your organization's cooperation in reviewing this matter.\"\n\nThe lawmakers noted that \"the Biden-Harris administration publicly opposed the proposed judicial reforms, with President Biden stating that Israel 'cannot continue down this road.' Subsequently, reports emerged that these protests were partially funded by American grants funneled through U.S. and Israeli NGOs to groups leading the opposition to judicial reform.\"\n\nAccording to the lawmakers, in 2023, the Israeli organization Blue and White Future, which financed and operated the protest coalition against judicial reform, received approximately $4 million from MEPDN. That money, they claim, came from grants funded by USAID and the State Department and was funneled to MEPDN through the Jewish Communal Fund and Rockefeller Philanthropy Advisors.\n\nThe lawmakers also allege that this is not the first time federal grants have been used to support protests against Netanyahu or his policies. They further claim that \"USAID and the State Department have even provided direct support to Hamas and other terrorist groups. Between 2007 and 2024, USAID and the State Department transferred at least $122 million to NGOs linked to designated terrorist organizations. Many of these groups have openly expressed antisemitic rhetoric and incited violence against Jews.\"\n\nThe committees are now demanding clarification regarding the flow of funds. \"Congress has a significant interest in ensuring that federal grant money is used in a manner consistent with legal authorization and legislative intent,\" the lawmakers wrote.\n\n|\n\n|\n\n|\n\n>>",
        "main_image": {
            "original_url": "https://ynet-pic1.yit.co.il/cdn-cgi/image/format=auto/picserver6/crop_images/2023/03/27/ryZk7Syb2/ryZk7Syb2_0_0_850_479_0_x-large.jpg",
            "local_path": "/article-images/house-republicans-claim-biden-used-funding-to-unde.jpg"
        },
        "content_images": []
    },
    {
        "url": "https://www.ynetnews.com/article/bk5e2611ake",
        "title": "'Waiting for them to say it's a mistake': Teen survivors of October 7 talk about their murdered fathers still in Gaza",
        "description": "Ofir Sharabi and Noga Weiss, childhood friends bound by the loss of their fathers in Hamas' attacks, recount their fractured lives — caught between clinging to hope for a miracle and confronting the trauma of a grief that refuses to heal",
        "content": "When 16-year-old Ofir Sharabi speaks about her father, Yossi,\n\nwho was murdered in captivity and whose body remains in Gaza\n\n, she does so in the present tense. \"My father was kidnapped alive. I saw it with my own eyes. I can't believe anything else because I have no proof. Don't tell me otherwise,\" she says in a rare interview with Ynet.\n\nBeside her sits 19-year-old Noga Weiss, her childhood friend and fellow\n\nKibbutz Be'eri\n\nmember. In her first interview since being released from captivity in Gaza, Noga\n\nrecalls her father, Ilan\n\n, who was murdered on October 7 and whose body is also being held in Gaza. \"I understand that he's dead but I still hope that one day I'll get a call saying it was a mistake. I'm still waiting for his hug.\"\n\nA hug — that’s all they want. In a world where the ground has crumbled beneath them, a simple embrace has become an unattainable dream. They share their trauma from October 7, the near-impossible struggle to return to normal life and their urgent plea to bring back their fathers and all the other hostages. \"Everything can wait but not this. It's life or death — for them and for us.\"\n\nThat morning, Ofir was at home with her father, Yossi, her mother, Nira, and her sisters, Oren and Yuval. Noga was with her parents, Shiri and Ilan, while her older sisters were in another part of the kibbutz. \"We ran to the safe room,\" Noga recalls.\n\n\"Soon after, my father, a member of the local alert squad, was called up. They told him there was a terrorist infiltration and that he needed to open the weapons safe. He said he'd be back in a few minutes and asked us to leave a key outside.\"\n\nMinutes passed, but he never returned. \"After five minutes, he was no longer reachable,\" Noga says. \"We texted him that terrorists were approaching. We thought he would come save us but he never responded. At 10:30 a.m., they broke into our house. My mom told me to hide under the bed. Then they stormed the safe room and took her.\"\n\nFrom under the bed, Noga saw everything. \"I texted people: 'They're kidnapping my mom.' After they took her, the terrorists stayed in the house and started setting it on fire. The door to the safe room had been forced open and the smoke filled the air — I couldn’t breathe. I decided I'd rather be shot than burn alive. I climbed out the window and saw terrorists and weapons everywhere.\n\n“I tried to hide behind a bush, but one of them spotted me within 10 minutes. He dragged me to a neighbor’s lawn, forced me to sit on the ground and tied my hands behind my back. As we moved, all I saw were bodies. I thought no one was left alive — not even my mom. I kept asking myself when my turn would come. I didn’t understand why they hadn’t shot me yet.\"\n\nNoga didn’t realize she was being kidnapped. \"They put me in a vehicle with the terrorists and we started driving,\" she says. \"I didn't see a single Israeli alive. I thought they were taking me to be executed. I wasn’t afraid of death; I had already accepted it. When my older sisters texted that there was gunfire near their home, I assumed they had been killed. I spent my entire captivity believing I had no family left. Thankfully, they survived.\"\n\nIn Gaza, Noga was taken to a house where she met Moran Stella Yanai. They remained together until Noga’s release, four days before Moran's. On the 14th day of captivity, Noga’s mother was brought to the house where she was held. \"When I saw her, I realized I still had family, that I wasn't alone,\" she recalls. \"Even though I was in Gaza, it was the best day of my life.\"\n\n:\n\n|\n\n:\n\nNoga quietly recounts the chilling moment when a terrorist brought her a ring. \"Among the guards, one was the most terrifying. When he got angry, he would enter the room with a gun — he was the 'bad cop.' Moran and I noticed that I was the one who had to ask him for things, that he was more attached to me. We would say, 'This is the kind of man who would kill his wife someday.'\n\n“One day, he came to me with a ring and said, 'You're going to marry me, stay in Gaza, bear my children and raise them here. All the hostages will be released but you'll stay because we’ll be married. Israel won’t care about you because they'll think you married me willingly.' I was in shock, panicked, not knowing how to react.\"\n\nLuckily, he wasn’t there when she was freed. Yet even her release was traumatic — she and Moran were separated without warning. \"We insisted on being released together and they told us, 'Yes, yes, of course.' Then, outside the house, they suddenly split us up without a word.\"\n\nDuring those fateful hours, Ofir lost everything she knew. Her father was kidnapped, her uncle taken as well and her aunt Lian, along with her cousins Yahel and Noya — whom she had grown up with — were murdered. Another cousin, Idan Herman, was murdered at the\n\nNova music festival\n\n.\n\n\"People don’t understand the trauma we’ve been through and are still living with,\" Ofir says. \"We put everything aside to focus on what matters most — bringing my father home — but we have so much else to deal with. I don’t talk about it much.\n\n“I don’t want people to know my story before they know me, especially now at a new school. But I’m stuck in that day. I can’t even begin to process or heal. My body won’t let me. We want the hostages back not just for them but for us, for our souls, to return to life.\"\n\nA few weeks ago, her uncle\n\nEli Sharabi\n\nwas released from captivity. \"When he came back, it was incredible but it was bittersweet because for me, it's not over. My father is still there. That puts me in a really difficult place. I carry so much fear. If I see someone who looks like a terrorist, I freeze — I just want to run. And then there’s this thought: Why am I alive?\"\n\nNoga shares similar feelings, mourning her uncle Gil and cousin Inbar, who was killed fighting on October 7. \"I constantly feel guilt. Why am I alive and they’re not? It never leaves me.\" Despite her ordeal,\n\nNoga chose to enlist in the IDF\n\n. \"I struggled with the decision,\" she says.\n\n\"After captivity, I didn't think I could stay in Israel. I was afraid, unsure if I could ever feel safe here. But gradually, I realized that to reclaim my life, I needed to follow my plan and enlist. It also feels like a way to help bring the hostages home. My mom supported me — she saw how much I wanted it.\"\n\nFor Ofir, resuming normal life means adjusting to a new school. \"I attend, but they expect me to study and I’m just not there. My mind is with my father. Where is he? What’s happening to him? When will he come back? That’s all I think about. I don’t want to be like this — I want to be with friends, to have fun, to focus on my exams.\"\n\nOfir clings to hope. \"My dad is the most present person in my life — I can’t imagine it without him. You can't not love him. Even the terrorists liked him. He has no bad in him, only good. We shared the same passions.\n\n“He taught me to surf and I keep doing it because that’s where I feel him the most. My biggest fear is that when he returns, I’ll have to face the reality that he’s gone. I won’t accept that thought. I refuse to believe he won’t come back.\"\n\nNoga feels the same about her father, Ilan. \"If he had to choose how to die, it would be this way — defending the kibbutz and our home. He was selfless, always helping others. Even if he knew he was going to die, he would still have done it. I was always a daddy’s girl. If he was around, I felt safe. I would go through everything again just to have grown up with him.\"\n\n|\n\n|\n\n|\n\n>>",
        "main_image": {
            "original_url": "https://ynet-pic1.yit.co.il/cdn-cgi/image/format=auto/picserver6/crop_images/2025/03/24/ryZ0HVfkT1l/ryZ0HVfkT1l_0_77_1280_720_0_x-large.jpg",
            "local_path": "/article-images/waiting-for-them-to-say-its-a-mistake-teen-survivo.jpg"
        },
        "content_images": []
    },
    {
        "url": "https://www.ynetnews.com/article/rycjmzxtke",
        "title": "Supreme Court unanimously rejects petitions to prevent cut to Gaza humanitarian  aid",
        "description": "The justices ruled that Israel is acting according to the directives of the political echelon and its obligations under international and Israeli law; The court ruled that the 'law of belligerent occupation' does not apply to Israel, since Hamas has not lost its ability to exercise governmental powers in the Gaza Strip",
        "content": "Israel’s Supreme Court unanimously rejected petitions from left-wing and human rights organizations demanding that the government expand humanitarian aid to Gaza during the ongoing war after it made extensive cuts. Chief Justice Yitzhak Amit ruled that Israel has fulfilled its obligations under international law and therefore dismissed the case.\n\nJustice Noam Sohlberg wrote that “the factual reality we encountered differs from the portrayal presented by the petitioners. The Israel Defense Forces’ efforts to facilitate humanitarian aid into Gaza, alongside intense military operations, are unprecedented among the world’s armies.”\n\nThe court ruled that the laws of military occupation do not apply to Israel regarding Gaza, as Israel does not exercise governmental authority in the enclave, and Hamas has not lost its governing capabilities.\n\nChief Justice Amit emphasized that\n\nIsrael does not directly provide humanitarian goods\n\nbut merely permits their entry, while terrorist organizations exploit the civilian population and seize aid shipments. The justices determined that the respondents’ conduct did not warrant judicial intervention, noting that no quantitative restrictions were imposed on the amount or type of aid, and that extensive efforts were made to improve infrastructure and mechanisms for aid delivery.\n\nJustices Sohlberg and David Mintz concurred with Amit. Sohlberg wrote that Israel had gone far beyond its obligations by facilitating humanitarian aid, even at the expense of operational priorities and at the risk of soldiers’ lives. “Senior IDF officials coordinated logistical and security needs to ensure the frequent and large-scale transfer of humanitarian aid to Gaza,” he stated.\n\n“Many dedicated soldiers and commanders worked on this day and night, beyond what was required, even at the cost of operational effectiveness. Tragically, some of our forces were harmed as a result of Hamas’ cruelty, as it did not hesitate to launch attacks, even at aid distribution points,” Sohlberg added. “Hamas’ murderous hand was also evident in the hostile takeover of humanitarian aid shipments. However, Hamas’ brutality did not deter IDF soldiers. Yet, it is clear to any reasonable person that excessive ‘humanitarianism’ that is unfocused misses its goal. Aid that falls directly into Hamas’ hands is an oxymoron; what is intended to be humane becomes predatory. Such an approach does not bring peace, but rather perpetuates pain and suffering.”\n\n:\n\n|\n\n:\n\nWhile Mintz agreed with Amit’s ruling, he dissented on the notion that Israel has any legal obligation to provide humanitarian aid to Gaza, asserting that the matter falls under the discretion of the government and security authorities, and the court should not intervene.\n\n“Even if there is a legal basis for allowing humanitarian aid to uninvolved civilians, there is no obligation to provide broad, unlimited aid, nor dual-use materials that could reach enemy hands and be used against Israel,” Mintz wrote. “The IDF and the respondents have gone above and beyond to facilitate aid to Gaza, even at the risk that it could be seized by Hamas and used for its war efforts. In this regard, I agree with my colleague, Justice Sohlberg. As noted, the provision, scope, and nature of aid are matters for the government and the IDF’s broad discretion, and there is no justification for judicial intervention.”\n\n|\n\n|\n\n|\n\n>>",
        "main_image": {
            "original_url": "https://ynet-pic1.yit.co.il/cdn-cgi/image/format=auto/picserver6/crop_images/2025/03/02/ByrxcR11jye/ByrxcR11jye_0_74_3000_1688_0_x-large.jpg",
            "local_path": "/article-images/supreme-court-unanimously-rejects-petitions-to-pre-1.jpg"
        },
        "content_images": []
    },
    {
        "url": "https://www.ynetnews.com/article/hks008g7tkx",
        "title": "War and hostages: Netanyahu to hold security consultation as Egypt claims 'positive indications' from Israel",
        "description": "Shin Bet and Mossad chiefs, the defense minister, and other officials will meet with the prime minister for a security consultation on the war and hostage negotiations; Meanwhile, Egyptian delegation traveled to Doha to continue negotiations on the second phase of a potential agreement",
        "content": "Prime Minister Benjamin Netanyahu\n\nis set to convene a security consultation on Thursday. Embattled\n\nShin Bet chief Ronen Bar\n\nis expected to attend, as well as other officials, including Defense Minister Israel Katz, Finance Minister Bezalel Smotrich, IDF Chief of Staff Eyal Zamir, Mossad Director David Barnea, and National Security Minister Itamar Ben-Gvir.\n\nThe meeting will focus on the ongoing war and efforts to secure the release of hostages.\n\nMeanwhile, an Egyptian delegation traveled to Doha on Thursday to continue negotiations on the second phase of a potential agreement. According to Egyptian officials, talks will include discussions on expanding humanitarian aid to Gaza, as mediators seek to resolve the deadlock that emerged following the conclusion of the first phase and Israel’s rejection of Hamas' conditions for the next stage.\n\nReuters reported, citing security sources - apparently Egyptian - that Cairo had received \"positive indications from Israel\" about a new ceasefire proposal, which would include an additional transitional phase on the way to Phase II. As part of that proposal, it was reported, Hamas would release \"five hostages each week.\" It was not specified whether the hostages were alive or dead, and Israel later claimed that they had not been presented with any Egyptian proposal - and that there is no Israeli negotiating team in Qatar. As of today, there are 59 hostages in Gaza, with 24 known to be alive.\n\nA Palestinian official said that, as part of the mediation efforts, \"there are some proposals that look better than the previous ones\" - but when asked if he expected an announcement of a breakthrough, he replied: \"Maybe not yet.\"\n\nEgypt has not yet presented its proposal to Israel, as it is first seeking an understanding with Hamas.\n\nThe previous initiative reportedly included the release of five living hostages, including Edan Alexander,\n\nin exchange for a seven-week cease-fire, a resumption of humanitarian aid, and the release of hundreds of Palestinian prisoners. Hamas, however, has set conditions and demanded guarantees, prompting Egypt to exert significant pressure, including the threat of expelling prisoners who were previously deported to Egypt.\n\nQatari officials have expressed skepticism over the Egyptian initiative, with some calling it unserious and already a failure. Tensions between Qatar and Egypt over which country should lead the mediation efforts have further complicated the process. Sources familiar with the talks said Qatari officials told U.S. businessman and US special Mideast envoy Steve Witkoff that they view Egypt’s proposal as unviable, though analysts suggest Qatar is also concerned about losing its role as the primary mediator.\n\nThe United States has been lukewarm toward the Egyptian proposal, while Israel continues to intensify military pressure on Hamas without launching a full-scale ground maneuver. Reports Thursday indicated a\n\nseries of Israeli airstrikes in Gaza\n\n, including an attack in Nuseirat and another in central Gaza City that killed four people, according to Hamas-affiliated media.\n\n:\n\n|\n\n:\n\nA senior U.S. official said Washington believes Israel has justification to resume its military campaign given Hamas’ refusal to negotiate but stressed the need for it to be “highly targeted, efficient, and effective” because “we don’t have unlimited time.”\n\nThe official also reiterated President Donald Trump’s commitment to advancing a Saudi-Israeli normalization deal, saying he would not allow Israel to derail it. “The clock is ticking,” the official said. He also criticized Ben-Gvir and Smotrich, saying they “do not understand geopolitical realities or where they stand.”\n\n|\n\n|\n\n|\n\n>>",
        "main_image": {
            "original_url": "https://ynet-pic1.yit.co.il/cdn-cgi/image/format=auto/picserver6/crop_images/2025/03/08/SkOwYVqoJe/SkOwYVqoJe_0_0_850_479_0_x-large.jpg",
            "local_path": "/article-images/war-and-hostages-netanyahu-to-hold-security-consul-1.jpg"
        },
        "content_images": []
    },
    {
        "url": "https://www.ynetnews.com/article/rkkhjkmpjl",
        "title": "IDF to submit investigations on October 7 failures to State Comptroller by end of April",
        "description": " IDF Chief of Staff, State Comptroller agree on  outline for beginning a review process for the military's October 7 failures; \"This is a continuation of the agreements from November, on the basis of which dozens of reviews have taken place in the IDF in recent months on 70% of the issu",
        "content": "State Comptroller Matanyahu Englman and IDF Chief of Staff Lt. Gen. Eyal Zamir announced Thursday that they have agreed on a framework to begin an audit of the military’s failures on October 7 and the events leading up to it. The IDF will submit its internal investigations to the comptroller by the end of next month.\n\nIn a joint statement, the IDF and the State Comptroller’s Office said the framework will focus on “core issues within the IDF, while maintaining continued cooperation and shared responsibility for state security and operational needs.” They noted that this agreement builds on understandings reached in November 2024, which have already led to dozens of IDF audits covering 70% of the relevant topics in recent months.\n\nAs part of the agreement between Englman and Zamir, the comptroller’s office will take into account the military’s operational needs and dynamic security realities, coordinating with the IDF to manage the workload resulting from the audits.\n\n:\n\n|\n\n:\n\nThe agreed-upon principles for completing the audit plan include: Transferring materials needed for the remaining audits; Investigations; Requests for operational chat logs; Drafts of audit reports; Fieldwork phases for audits from stages A and B; Scheduling of fieldwork for key audits related to security at the Nova music festival, urban defense, security measures and emergency response teams, the protection of the Gaza border, intelligence community procedures (including oversight and IDF transparency regarding enemy assessments), and the sequence of events on October 7, 2023; Significant changes in the security situation; New audits; Coordination mechanisms; and a dispute resolution mechanism.\n\nThe published framework also outlines audits that are still in the fieldwork phase or have yet to begin (excluding core audits). These include: Government public relations efforts in the international arena—fieldwork has begun; Economic warfare against terrorism—fieldwork has begun; The role of the Security Cabinet before the outbreak of Operation Iron Swords—fieldwork has not yet begun; Compliance with ammunition stockpile targets in light of Operation Iron Swords—fieldwork has not yet begun; The national blood supply system—fieldwork has begun; Coordination between aid organizations and state authorities—fieldwork has not yet begun (the Home Front Command has requested a meeting); Protective infrastructure in local municipalities—fieldwork has not yet begun; Protection of hospitals—fieldwork has begun; The IDF’s preparedness for underground threats—fieldwork has not yet begun.\n\n|\n\n|\n\n|\n\n>>",
        "main_image": {
            "original_url": "https://ynet-pic1.yit.co.il/cdn-cgi/image/format=auto/picserver6/crop_images/2025/03/27/H1ujN6fake/H1ujN6fake_0_0_850_479_0_x-large.jpg",
            "local_path": "/article-images/idf-to-submit-investigations-on-october-7-failures-1.jpg"
        },
        "content_images": []
    },
    {
        "url": "https://www.ynetnews.com/article/hjiltoftjx#autoplay",
        "title": "'He's physically here, but not mentally': Ohad Ben Ami's daughter on the former hostage's condition",
        "description": "Ella Ben-Ami breaks her silence on her father Ohad’s psychological battle after Hamas captivity, describing his haunting detachment and relentless advocacy for hostages still trapped in Gaza; He takes half a pita after a meal",
        "content": "Ella Ben Ami, daughter of\n\nformer hostage Ohad Ben Ami\n\nwho was\n\nreleased after 491 days in Hamas captivity\n\n, said Thursday that her father sometimes behaves as if he's still being held by terrorists. \"You see it when he takes half a pita after a meal and when he talks about what's happening there as if he's still there,\" she told Ynet in an interview.\n\n\"He's physically here, but mentally, he's not. Honestly, all the hostages who returned carry the burden of those still there. They're the only ones who truly know what's happening and how it feels,\" she said.\n\nShe also described her father's reaction to Hamas' recent\n\nsign of life video featuring hostages Elkana Buhbut and Yosef-Haim Ohana\n\n, who were held with him. \"It sounds crazy but he was happy to see them, to see they're okay. He misses them so much and talks about them all day.\"\n\nBen-Ami explained that her father traveled to Germany to push for the release of the remaining hostages. \"He's trying to make an impact wherever he can and fight for the people he left behind. We have German citizenship so we can meet with high-ranking officials there. He felt it was the right thing to do.\"\n\n:\n\n|\n\n:\n\nMeanwhile, Nadav Miran, brother of\n\nOmri Miran\n\n, who remains in Hamas captivity, criticized the government’s handling of the hostages and the ongoing fighting in Gaza. Speaking to Ynet, he said: \"Israel decided to go in and fight, but in reality nothing is happening.\"\n\n\"If you truly want to bring the hostages home quickly and if you’ve decided to fight — then fight, with everything that it entails,\" he said, calling for a more aggressive military approach.\n\n\"Israel needs to approach this in a way that actually takes territory from Hamas, not just talk about it. Seizing food warehouses, putting real pressure on them — right now, there's no real pressure. They keep saying they're going back to fighting but all they do is make threats. No major forces are going in, no land is being taken and Hamas isn’t being told, 'You’re not getting them back.'\"\n\nMiran argued that Hamas would never agree to a hostage deal without a full ceasefire — and even then, he says he doubts the terror group would release all captives. \"They won’t believe Israel will truly stop fighting, so they'll always hold onto hostages, releasing them over years, not days. The goal should be to pressure them until they have no choice but to surrender and return all the hostages at once, not in groups.\"\n\n\"Talk about all of them. Get them all out. Find a final solution that brings every hostage back to Israel, to their families. I don’t understand these partial deals,\" he concluded.\n\n|\n\n|\n\n|\n\n>>",
        "main_image": {
            "original_url": "https://ynet-pic1.yit.co.il/cdn-cgi/image/format=auto/picserver6/crop_images/2025/02/15/BkenMw0Kyl/BkenMw0Kyl_0_0_1280_720_0_x-large.jpg",
            "local_path": "/article-images/hes-physically-here-but-not-mentally-ohad-ben-amis-2.jpg"
        },
        "content_images": []
    },
    {
        "url": "https://www.ynetnews.com/article/hjoqvpgake",
        "title": "Police: Palestinian bus bomb plot suspect found working at Bat Yam ice cream parlor",
        "description": "Authorities say suspect held under administrative detention for about a month; incident, which caused no casualties, involved 4 explosive devices detonating on empty buses in greater Tel Aviv area",
        "content": "A Palestinian man living in Israel illegally,\n\nsuspected of involvement in last month’s bus bombing attempts in Bat Yam and Holon\n\n, was found working at a branch of the Golda ice cream chain in Bat Yam and was arrested there days after the attacks, Israeli police said.\n\nThe suspect has been held under administrative detention for about a month. He was employed at the shop without proper permits, unsupervised, and paid in cash, police said. The ice cream shop was closed shortly after his arrest by order of Tel Aviv District Police Commander Maj. Gen. Chaim Sargrof and reopened Thursday, only to be shut down again by police later in the day.\n\nPolice have requested that a Tel Aviv court extend the closure order on the branch, located on Ben-Gurion Street and operated under a franchise agreement. According to court filings, officers visited the shop four days after the bus explosions and found the suspect alone at the scene.\n\nThe investigation also revealed the man had worked there for about a month. Police said this was not the first time the franchise owner had employed individuals without legal status and had previously been questioned over similar violations.\n\n“The respondent employed an illegal resident and provided him with a substantial source of income, despite the fact that he poses a clear threat to national security and is currently under administrative detention,” Sargrof wrote in the closure request. “The respondent acted illegally, driven by cynical economic motives and blatant disregard for the public interest, especially at a time when the State of Israel is fighting for its existence.”\n\nNo injuries were reported in the coordinated bombing attempt, which involved four explosive devices planted on buses in the Tel Aviv suburb of Bat Yam and nearby Holon. Three of the devices detonated on empty buses parked in Bat Yam. A fourth was discovered and neutralized near Wolfson Medical Center in Holon.\n\nThe unexploded device weighed about 5 kilograms (11 pounds) and bore a message in Arabic reading “Revenge from Tulkarem.”\n\nHamas’s military wing in Tulkarem later suggested responsibility, citing Israeli military activity in the area\n\n.\n\nA gag order placed on the case was lifted in recent days. Security forces are continuing to search for additional suspects.\n\nEarlier this month,\n\nIsraeli prosecutors indicted Rubin Dadbayev for assisting the bomber\n\n, who entered Israel illegally and arranged for transportation to Ariel on the day of the attack. According to the indictment, the bomber initially contacted another individual to drive him, but that person referred him to Dadbayev. The two allegedly met in Bat Yam, and Dadbayev drove the man toward Ariel and later to another West Bank location in exchange for payment.\n\n:\n\n|\n\n:\n\nThe suspect allegedly changed clothes before the trip to avoid detection due to explosive residue. Dadbayev told investigators he believed the man was a Jaffa resident and spoke Hebrew with an accent.\n\nIn response to the investigation, Golda said in a statement that franchisees are solely responsible for hiring decisions. “According to the information provided by the franchisee, the employee worked for a few weeks and presented a blue Israeli ID card,” the company said. “To our knowledge, the police investigation is still ongoing. If misconduct is found, the chain will take firm action.”\n\n|\n\n|\n\n|\n\n>>",
        "main_image": {
            "original_url": "https://ynet-pic1.yit.co.il/cdn-cgi/image/format=auto/picserver6/crop_images/2025/02/21/SJVfaKnSqkg/SJVfaKnSqkg_2_1_1138_853_0_x-large.jpg",
            "local_path": "/article-images/police-palestinian-bus-bomb-plot-suspect-found-wor-2.jpg"
        },
        "content_images": []
    },
    {
        "url": "https://www.ynetnews.com/article/hk965hza1x",
        "title": "Nationalist Bosnian Serb leader attends Israeli antisemitism conference",
        "description": "Diaspora Affairs Minister Amichai Chikli sparks further controversy by hosting Milorad Dodik at an antisemitism summit already under fire for inviting far-right figures, prompting high-profile withdrawals     ",
        "content": "A court in Bosnia has issued an international arrest warrant through Interpol for Milorad Dodik, the leader of Republika Srpska, the Serb political entity that, along with the Bosniak-Croat Federation, makes up Bosnia and Herzegovina. According to the warrant, the 66-year-old Dodik is accused of \"attacking the constitutional order\" of the country.\n\nDodik is currently in Israel\n\nattending a conference hosted by Diaspora Affairs Minister Amichai Chikli on combating antisemitism\n\n—a gathering that has stirred controversy over its list of invited guests.\n\nChikli invited parliamentarians from around the world, heads of Jewish communities, and others to the conference\n\n. Among the invitees is\n\nJordan Bardella, leader of France’s National Rally party (RN)\n\n, alongside several other representatives from far-right European parties. The controversial guest list led several high-profile invitees to withdraw, and Israeli President Isaac Herzog announced he would not attend.\n\nIn recent weeks, following a Bosnian court ruling against him, Dodik has led a series of bold moves aimed at detaching Republika Srpska from Bosnia's central institutions—possibly in preparation for a future unification with Serbia. \"Come on, try to stop us!\" he declared in a recent speech to supporters, as national law enforcement authorities tried to bring him into custody. Experts warn the current crisis is the gravest threat to Bosnia’s stability and peace in the Balkans since the wars of the 1990s.\n\nDodik has served as the political leader of the Bosnian Serbs since 2006. In February, he was convicted of defying the orders of the international high representative overseeing the peace agreement that governs Bosnia’s two political entities. A court sentenced him to one year in prison and barred him from holding public office for six years.\n\nIn response, Republika Srpska’s local parliament passed laws banning Bosnia’s national police, courts and intelligence services from operating within its territory, which accounts for 49 percent of Bosnia. As a result, Bosnian prosecutors issued arrest warrants for Dodik, the entity’s prime minister and its parliamentary speaker.\n\nAll three refused to appear for questioning. Dodik declared he does not recognize the authority of the Bosnian prosecutor's office and considers the warrant void. Republika Srpska’s interior minister said local police would enforce the new laws and prevent central government forces from operating in the entity, stating, “No one will be arrested, everyone will be protected.”\n\n:\n\n|\n\n:\n\nBosnia and Herzegovina was established following the breakup of Yugoslavia, as the republics that made up the former federation sought independence. While Bosniaks (Bosnian Muslims) and Croats voted in favor of independence, Serbs in Bosnia opposed the move, fearing minority status in a sovereign Bosnia. The conflict that followed, known as the Bosnian War (1992–1995), resulted in around 100,000 deaths. Bosnian Serbs were supported by Serbia, while Bosnian Croats were backed by Croatia.\n\nThe war ended with a U.S.-brokered peace agreement, which created a unified Bosnia consisting of two political entities: the Bosniak-Croat Federation and Republika Srpska. Each has its own parliament, government, police, and judiciary. The Bosniak-Croat Federation is further divided into cantons, each with its own local government.\n\n|\n\n|\n\n|\n\n>>",
        "main_image": {
            "original_url": "https://ynet-pic1.yit.co.il/cdn-cgi/image/format=auto/picserver6/crop_images/2025/03/27/BJl3oiMakg/BJl3oiMakg_0_0_1280_961_0_x-large.jpg",
            "local_path": "/article-images/nationalist-bosnian-serb-leader-attends-israeli-an-2.jpg"
        },
        "content_images": []
    }
]