[
    {
        "url": "https://www.ynetnews.com/article/hjdyzix6ye#autoplay",
        "title": "After son seen in Hamas video, father of hostage has some relief ",
        "description": "'He is in bad shape, he was strong and muscular, and now he is thin';  Father of Yosef-Chaim Ohana says; calls on government to immediately work to ensure his release; 'He is begging to come home'",
        "content": "\"Seeing him alive in the video for the first time since October 7 moved the entire family,\" Avi Ohana, the father of hostage Yosef-Chaim Ohana, said Monday in an interview with Ynet,\n\nfollowing the release of a Hamas video showing his son\n\n.\n\n\"It gave us hope. I thank God, and we are praying intensely across the country. Now, more than ever, they must bring them home. We need a swift deal—not an all-out war.\"\n\nHe emphasized the urgency of securing the hostages' release, expressing concern over his son's deteriorating condition. \"They need to get them out already—you can see how bad it is. I know my son; he is thin, and it’s clear he is in worse shape. He was a very strong, muscular kid, and now he looks emaciated,\" Ohana said.\n\nOhana also shared a message he received through\n\nOhad Ben Ami\n\n, a former hostage who was released in a prisoner exchange. \"He desperately wants to come home,\" Ohana said. \"Through Ohad, he told us that he misses us deeply and asked us to stay strong. He wants to return home, to see his siblings and family. He loves us. The message is clear—he is longing to come home to his family.\"\n\nAs a father, Ohana described how his family's life has been in turmoil since his son was taken. \"Our lives stopped on October 7,\" he said. \"I told Gal Hirsch —we no longer have lives. Everything revolves around him. We are doing everything possible for him and the other hostages. Life has stopped—we don’t work, we don’t function normally, we barely eat or sleep. Our immediate family is in a very difficult state. We are just waiting for this nightmare to end. We are living in a nightmare. I dream of him at night—being together, the family happy—and then I wake up and wish I could stay in the dream. Reality is a nightmare.\"\n\nOhana appealed to Ben Ami in the video, urging him to speak for those left behind in captivity. \"They fear for their lives, they have no hope, and since the fighting resumed, their conditions have worsened and their food supply has been reduced,\" Ben Ami said in a post.\n\n:\n\n|\n\n:\n\nHe is currently in Germany as part of a delegation set to meet with the new German chancellor and other government officials. \"Everything is aimed at influencing decision-makers in Israel to bring the hostages home—not today, but yesterday—even if it requires an immediate stop to the war,\" he wrote. \"I have said before and will say again—you can always resume fighting after bringing all the hostages back if Hamas violates the ceasefire.\"\n\nHe added, \"Hamas isn’t going anywhere, and there will always be a way to deal with them. But the hostages may not survive the coming days because they are in constant danger since the fighting resumed. We will not rest until the last hostage is home. To my five friends I left behind—I love and miss you, and I will do everything in my power to bring you and all the hostages back home alive.\"\n\n|\n\n|\n\n|\n\n>>",
        "main_image": {
            "original_url": "https://ynet-pic1.yit.co.il/cdn-cgi/image/format=auto/picserver6/crop_images/2025/03/24/r1yovm16Jx/r1yovm16Jx_0_47_780_439_0_x-large.jpg",
            "local_path": "/article-images/after-son-seen-in-hamas-video-father-of-hostage-ha.jpg"
        },
        "content_images": []
    },
    {
        "url": "https://www.ynetnews.com/article/bkerpvepye",
        "title": "Gaza war must be focused, effective, with limited timeframe, US officials say",
        "description": "American officials say there is no point in dragging the offensive against Hamas out; expect Netanyahu to agree to a hostage release deal now that his coalition is secure after the budget vote ",
        "content": "American officials believe that although Israel is justified in renewing its war against Hamas, after negotiations to bring about the release of hostages have stalled but it must be focused and effective. \"We don't have all the time in the world,\" one official said.\n\nIsraelis who spoke with the officials said they understood that Israel had American backing to continue the fighting in Gaza but not indefinitely. A military offensive during negotiations does have an effect, but \"there is no sense in dragging it out without reason. Israel's government must admit its credit from the administration is limited.\"\n\nAnother American official said U.S. President Donald Trump was determined to secure a deal with Saudi Arabia and \"would not allow Israel to destroy it.\" He said the clock was running out. The official also commented on statements made by Prime Minister Benjamin Netanyahu's far-right coalition partners, ministers Itamar Ben-Gvir and Bezalel Smotrich. \"They don't know how to read the geo-political map, he said. \"They don't understand where they are.\"\n\nAfter Netanyahu successfully passed a budget on Tuesday, securing his government's continued rule and relieving some of the internal political pressure on him, the Americans expect him to move toward a deal with Hamas.\n\nSources around the prime minister said the budget vote had nothing to do with the hostage negotiation and that Israel continues to support U.S. envoy Steve Witkoff's proposal that would see all of the prisoners released in two phases.\n\nEgypt continued to promote its proposal that would see Hamas release five live hostages, including American Edan Alexander, in exchange for a seven-week truce, a renewal of humanitarian aid deliveries to the Strip and the release of hundreds of Palestinian prisoners held in Israeli jails.\n\nThe Egyptians were reportedly putting pressure on Hamas, including threats to expel the prisoners who were released during the cease-fire and were in Egypt. Israeli officials said they have not received any proposal from Egypt",
        "main_image": {
            "original_url": "https://ynet-pic1.yit.co.il/cdn-cgi/image/format=auto/picserver6/crop_images/2025/03/06/B1tH0OPjyx/B1tH0OPjyx_0_0_850_479_0_x-large.jpg",
            "local_path": "/article-images/gaza-war-must-be-focused-effective-with-limited-ti-1.jpg"
        },
        "content_images": []
    },
    {
        "url": "https://www.ynetnews.com/article/sjyw4peaye#autoplay",
        "title": "'Hamas must go': Gazans demand an end to war in protest",
        "description": "In the first demonstration of its kind, hundreds of residents of northern Gaza demonstrate against Hamas rule and say they refuse to be governed at gunpoint  ",
        "content": "Hundreds of Palestinian residents of northern Gaza protested on Tuesday, calling for an end to the war. This was the first time that civilians came out in an organized demonstration against the Hamas narrative. Hamas has called for resilience and for Gazans to cling to their land.\n\nThe protestors held up signs reading \"End the war now,\" and \"Hamas, out, Hamas must go.\" One protester said the residents of the northern Gaza town of Beit Lahiya were peaceful. We demand peace and security and not to be governed at gunpoint,\" he said.\n\n:\n\n|\n\n:\n\n\"We will decide who will rule over us,\" he said. Hamas terrorists arrived at the scene to break up the demonstration.\n\n|\n\n|\n\n|\n\n>>",
        "main_image": {
            "original_url": "https://ynet-pic1.yit.co.il/cdn-cgi/image/format=auto/picserver6/crop_images/2025/03/25/Bygkz5HxpJx/Bygkz5HxpJx_0_195_466_263_0_x-large.jpg",
            "local_path": "/article-images/hamas-must-go-gazans-demand-an-end-to-war-in-prote-2.jpg"
        },
        "content_images": []
    },
    {
        "url": "https://www.ynetnews.com/article/hyxzh11e6jg#autoplay",
        "title": "'Israel can't count on Trump's support against Iran,' Putlitzer Prize-winning journalist says ",
        "description": "Judith Miller talks with Ynet on seismic shifts in Middle East dynamics post-October 7, warning of generational divides, eroding trust in institutions and the urgent need for accountability and strategic clarity",
        "content": "Pulitzer Prize-winning journalist Judith Miller, who has spent nearly five decades covering the Middle East, described the\n\nOctober 7 Hamas attack\n\non Israel as an unprecedented event that deeply affected not only Israel but also American Jews. Despite her extensive experience covering wars and conflicts in the region, she said she had never witnessed anything like it.\n\n\"I had never seen, in all the wars, all the fighting, all the slurs, and the misery, anything like October 7. And I think it had a profound effect, not only on anyone who knows the Middle East and has covered the Middle East but also on all American Jews,\" Miller told Ynet in an interview.\n\nAfter visiting Israel in March and seeing the aftermath of Hamas’ murderous rampage firsthand, including the\n\ndevastated kibbutzim\n\nand the site of the\n\nNova music festival massacre\n\n, Miller said the reality of the attack became even more shocking.\n\nMiller, who has long believed that resolving the Palestinian issue was central to achieving peace in the region, said the events of October 7 altered her view on the viability of a\n\ntwo-state solution\n\n.\n\n\"I now believe that... there's not going to be a two-state solution anytime soon. It's just a non-starter,\" she said. \"After October 7, it's going to take a long, long, long time for the pain and the suffering to subside.\"\n\nMiller also expressed concern about Israel's declining support among young Americans,\n\nparticularly on college campuses\n\n. She noted a significant shift in perception, where Israel is increasingly seen as an aggressor rather than a victim.\n\n\"Younger Jews — and a lot of them — but definitely younger non-Jews,\n\nsee Israel not as David, but as the Goliath now\n\n,\" she said. \"There's been a generation of kind of brainwashing that Israel is a neo-colonialist state intent on persecuting and driving out Palestinians.\"\n\nShe stressed the challenge this poses, particularly for American Jews who strongly support Israel. \"Israel has lost this battle among younger Americans. And it's a huge challenge, especially for American Jews who trust Israel, believe in Israel and believe in the inseparability of Jews from Zionism,\" she said.\n\nMiller warned that the growing divide among young Americans, coupled with shifting U.S. political dynamics, could further complicate Israel's standing in the long run. She also cautioned against assuming that President Donald Trump, despite his pro-Israel rhetoric, would be a reliable ally in\n\na potential conflict with Iran\n\n.\n\n\"I don't think you can count on Donald Trump being on [Netanyahu's] side,\" she said, adding that Trump’s isolationist tendencies and transactional approach to foreign policy make him unpredictable.\n\nShe argued that the real solution to the Iranian nuclear threat lies not in military strikes but in supporting Iranian efforts for regime change. \"If you have a change of regime, you have a chance of ending the nuclear program,\" she said.\n\n\"Even a military strike... I'm not sure it would destroy the program. It can set it back, that's for sure and that would be a good thing. But the only solution to an Iran that doesn't want a nuclear weapon is not military action, which I fear would build support for this unpopular regime, but is to get rid of the regime.\"\n\nMiller, who spent years as a journalist at\n\nThe New York Times\n\nand later at Fox News, voiced concern over the erosion of democratic institutions in both the U.S. and Israel.\n\n\"When your confidence in your institutions collapses, democracy is in danger,\" she said. \"President Trump has gone on an all-out campaign to weaken the credibility and support for these vital institutions, especially the press.\"\n\nShe defended the role of journalists, recalling Thomas Jefferson’s assertion that democracy cannot function without a free press. \"He calls us scum. He calls us the worst people in the world. But as Thomas Jefferson said, try to run a democracy without us. You can't.\"\n\nLooking at Israel’s regional relationships, Miller expressed confidence in the\n\ndurability of the peace agreement between Israel and Egypt\n\n, citing mutual security interests. However, she voiced greater concern about Jordan’s stability, given the large Palestinian population and regional turmoil.\n\n\"Jordan is in great danger,\" she said. \"And I think my country should do more to make sure that that regime is stable and secure.\"\n\nMiller also stressed that once the war in Gaza winds down, Israel must conduct a thorough review of its security failures on October 7. \"Israel really needs to have a reckoning and a deeper understanding of what happened on October 7. Some of the people responsible for it should be held accountable but I don't think all of them have been.\"\n\nAs Israel and the U.S. navigate the fallout from October 7, Miller's reflections underscore the deep challenges ahead, both in terms of security and public perception.\n\n:\n\n|\n\n:\n\n|\n\n|\n\n|\n\n>>",
        "main_image": {
            "original_url": "https://ynet-pic1.yit.co.il/cdn-cgi/image/format=auto/picserver6/crop_images/2025/03/13/Sk00hOxeh1x/Sk00hOxeh1x_0_83_3000_1688_0_x-large.jpg",
            "local_path": "/article-images/israel-cant-count-on-trumps-support-against-iran-p-2.jpg"
        },
        "content_images": []
    },
    {
        "url": "https://www.ynetnews.com/article/byuezlxa1e",
        "title": "Isareli top court upholds freez on ouster of Shin Bet chief ",
        "description": "Judges reject Prime Minister Netanyahu's request to remove their injunction but agree to allow the PM to interview candidates to replace Ronen Bar",
        "content": "The Supreme Court on Tuesday upheld its decision to temporarily suspend the firing of Shin Bet chief Ronen Bar by the government. The ruling came in response to appeals made to the court, including by Attorney General Gali Baharav-Miara. The judges also said that Prime Minister Benjamin Netanyahu would be allowed to interview candidates who would potentially replace Bar at the head of the security agency.\n\nThe government\n\nvoted to oust Bar\n\nlast week after Netanyahu said he had lost confidence in the senior security official. The ministers\n\nalso decided to fire the AG\n\n, prompting mass protests\n\nNetanyahu's decision to fire Bar came after the\n\nShin Bet released the findings\n\nof its inquiries into the failings that led to the Oct. 7 Hamas massacre. In the findings, the Shin Bet said Netanyahu ignored warnings that Hamas was building its military capabilities using the funding it received from Qatar, at Israel's urging.\n\n:\n\n|\n\n:\n\nBar was also investigating Netanyahu's close aids at the Prime Minister's Office (PMO) who were suspected of\n\nworking for the Qatari regime\n\n.\n\nNetanyahu said the investigation was politically motivated and the\n\nwork of the \"deep state\"\n\nand that Bar was attempting to remove a democratically elected right-wing government.\n\nIn his latest appeal to the court, the prime minister said the dismissal of the Shin Bet chief would not proceed without the court's final ruling on the matter.\n\n|\n\n|\n\n|\n\n>>",
        "main_image": {
            "original_url": "https://ynet-pic1.yit.co.il/cdn-cgi/image/format=auto/picserver6/crop_images/2025/03/25/HJCByUeTJl/HJCByUeTJl_0_0_850_479_0_x-large.jpg",
            "local_path": "/article-images/isareli-top-court-upholds-freez-on-ouster-of-shin--2.jpg"
        },
        "content_images": []
    },
    {
        "url": "https://www.ynetnews.com/article/b1njqrgajx#autoplay",
        "title": "'I woke up half naked surrounded by men': released hostage tells of sexual assault by Hamas",
        "description": "Ilana Grichowsky, whose partner is still held hostage, talks to US publication about sexual harassment; one captor holds a gun to her and says she will be married off and have babies in Gaza ",
        "content": "Former hostage Ilana Grichowsky, 31, the partner of\n\nMatan Tsangauker\n\n, who remains captive in\n\nGaza\n\n, revealed in an interview published Tuesday in The New York Times that she was sexually assaulted during her abduction to Gaza and suffered further abuse at the hands of one of her\n\nHamas\n\ncaptors.\n\nGrichowsky recounted that on\n\nOctober 7\n\n, she lost consciousness before being taken across the border to Gaza on a motorcycle with the terrorists. When she woke up, she found herself lying on the floor of a building, half-naked, surrounded by seven Hamas terrorists. According to her account, her shirt was pulled up above her chest, and her pants were lowered.\n\nGrichowsky said she did not know what happened while she was unconscious but recalled telling the militants that she was on her menstrual cycle, which she believes may have saved her from something worse. \"They hit me and lifted me up,\" she said. \"I don’t think I have ever been so thankful for my period.\"\n\nFor more than 50 days, Grichowsky was moved from place to place, mainly above ground. Initially, she was held alone with her captors, but later she was grouped with other hostages. She described being held in private homes, hospitals, and eventually in a tunnel before her release in a prisoner exchange deal in November 2023.\n\nGrichowsky said that during her captivity, she was interrogated about her military service. One of the terrorists, she recalled, hugged her while pointing a gun at her and told her that even if a deal was reached, he would not let her go because he wanted to marry her and have children with her. Another claimed to be a math teacher, while a third said he was a lawyer. The terrorists also stole her earrings and bracelet.\n\n:\n\n|\n\n:\n\nGrichowsky and Tsangauker lived in Nir Oz. She immigrated to Israel from Mexico as a teenager and began working at a medical cannabis farm, where she met Tsangauker. \"We loved the quiet of the kibbutz, with a cup of coffee and a cigarette. We prefer anonymity,\" she said.\n\nWhen Hamas terrorists raided the kibbutz — where one in four residents was either killed or abducted — they went house to house until they reached the couple's home. As the terrorists fired at their door, the two jumped out of the safe room window and ran in different directions. Grichowsky lost sight of Tsangauker and was eventually captured. She was beaten and taken to Gaza on a motorcycle.\n\nOn the motorcycle, Grichowsky sat between two terrorists, her head covered with a large plastic sheet. She said they pressed her leg against the exhaust pipe, causing a burn, and one of the terrorists groped her, touching her chest under her shirt and her legs. She fainted during the ride.\n\nGrichowsky described life without Tsangauker as an ongoing struggle. “I’m not really available for my own rehabilitation, not for the body and not least for the soul,” she said.\n\n“I live with the question of why me and not them. I have no answer,” she said, adding, “But if I am out, it’s a sign that God wanted me to raise my voice to help those who are alive gain their freedom and bring back the dead for a proper burial.”\n\n|\n\n|\n\n|\n\n>>",
        "main_image": {
            "original_url": "https://ynet-pic1.yit.co.il/cdn-cgi/image/format=auto/picserver6/crop_images/2024/12/17/HkXzR4rkS1e/HkXzR4rkS1e_0_310_731_411_0_x-large.jpg",
            "local_path": "/article-images/i-woke-up-half-naked-surrounded-by-men-released-ho-2.jpg"
        },
        "content_images": []
    },
    {
        "url": "https://www.ynetnews.com/article/hj6nq11xakl#autoplay",
        "title": "Israeli lawmakers approve 2025 state budget as protests continue outside Knesset",
        "description": "After hours of debate, the Knesset on Tuesday afternoon approved Israel’s 2025 state budget by vote of 66-52; It totals approximately 620 billion shekels — the largest in Israel’s history, including significant increases in defense spending and coalition-related allocations but also difficult cuts",
        "content": "After hours of debate, the Knesset on Tuesday afternoon approved\n\nIsrael’s 2025 state budget\n\n, which includes\n\nsignificant increases in defense spending\n\nand coalition-related allocations but cuts to funding for Gaza border and northern communities, at-risk youth, LGBTQ initiatives, and the expansion of the national drug basket. The vote passed 66-52.\n\nMeanwhile, outside the Knesset, protesters blocked the entrance by sitting on the ground and using vehicles as barricades in an illegal demonstration. Police arrested six demonstrators, stating that they had “parked their vehicles illegally, creating a significant safety hazard.” Officers worked to tow the vehicles while attempting to disperse the crowd.\n\nDue to the roadblocks, some lawmakers, including Almog Cohen and Finance Minister Bezalel Smotrich, had to walk to the Knesset instead of arriving by car. Defense Minister Israel Katz arrived via helicopter. Coalition Chairman Ofir Katz was reportedly making calls to missing Knesset members, as some were still stuck outside the building.\n\nWith the Knesset set to recess next week for a month-long spring break, the coalition aims to pass both the budget and a contentious bill to change the composition of the Judicial Selection Committee by Thursday. The budget debate, which began Monday at 8:00 p.m., will be followed by a “40-signature” session with Prime Minister Benjamin Netanyahu and an overnight debate on the judicial bill.\n\n:\n\n|\n\n:\n\nThe 2025 budget, which totals approximately 620 billion shekels — the largest in Israel’s history—was finalized after the far-right Otzma Yehudit party rejoined the coalition. With at least 63 MKs expected to vote in favor, its passage is all but assured. However, critics argue that the budget lacks meaningful benefits for the general public and that the planned deficit increase will further raise living costs.\n\nFinance Minister Bezalel Smotrich criticized the protesters outside the Knesset, saying it took him 30 minutes to reach the building from the Finance Ministry. “A handful of anarchists are breaking the law—this is a collapse of the rule of law. I call on the police chief to act. No other country would allow 20 people to block a road. You don’t care about the rule of law, only about maintaining privileges and power,” he said.\n\nSmotrich defended the budget, calling it “a war budget, a budget for reservists, the story of border heroes, pioneering settlers, and an entire nation fighting to win and bring back the hostages.” His speech was repeatedly interrupted by opposition Knesset members, with Yesh Atid’s Yoav Segalovich calling it “a story of corruption” and Elazar Stern adding, “Reservists don’t want money—they want someone to replace them in service. Children want their fathers home.”\n\nOpposition leader Yair Lapid denounced the budget as “a budget of thieves at the expense of honest people.” He called the vote “the biggest robbery in Israel’s history” and claimed that “this is not a budget—it is shameless theft.” Addressing the public, he said, “Middle-class Israelis are fed up with being taken for fools. They are tired of being exploited by a government that does not care about them.”\n\nThe 2025 budget allocates:\n\nDefense Ministry – 109.8 billion shekels\n\nEducation Ministry – 92 billion shekels\n\nHealth Ministry – 59 billion shekels\n\nNational Insurance Institute – 61 billion shekels\n\nPublic Security Ministry – 25 billion shekels\n\nSocial Welfare Ministry – 12 billion shekels\n\nVarious coalition funds – hundreds of millions more\n\nHowever, funding initially promised under the “Tkumah Law” for rebuilding Gaza border communities devastated on October 7, as well as aid for displaced residents in the north, was not included. Additionally, budgets were cut for: LGBTQ+ organizations, The National Authority for Community Security, at-risk youth programs, school classroom expansion, national drug basket\n\nWith the budget’s passage all but certain, the coalition is now shifting focus to passing the Judicial Selection Committee reform bill. Despite promises to ultra-Orthodox parties, the long-delayed military draft law remains stuck in the Foreign Affairs and Defense Committee, with no significant progress expected in the near future.\n\n|\n\n|\n\n|\n\n>>",
        "main_image": {
            "original_url": "https://ynet-pic1.yit.co.il/cdn-cgi/image/format=auto/picserver6/crop_images/2025/03/25/BkWNmDbgaye/BkWNmDbgaye_0_17_1280_720_0_x-large.jpg",
            "local_path": "/article-images/israeli-lawmakers-approve-2025-state-budget-as-pro-2.jpg"
        },
        "content_images": []
    },
    {
        "url": "https://www.ynetnews.com/article/bko2711gpjx#autoplay",
        "title": "Israeli airstrike kills gunmen in cross-border fire in Syria",
        "description": "Gunmen fire on Israeli forces operating in the buffer zone near Yarmouk River, in the southern part of the Syrian Golan Heights; at least 5 gunmen killed",
        "content": "An Israeli airstrike\n\nkilled at least five gunmen in southern Syria on Tuesday after the group opened fire at Israeli troops across the border in the Golan Heights, the Israeli military said.\n\nThe gunmen fired on Israeli forces operating in the buffer zone near the Yarmouk River, in the southern part of the Syrian Golan Heights. Israeli troops were not hurt in the exchange and called in air support, which carried out the strike, the military said.\n\nAccording to Syrian media, the incident took place in the village of Kuwaya in the Daraa province. Reports varied on the number of fatalities, with pro-Hezbollah outlet Al Mayadeen reporting six deaths, while other sources said five or seven. The strike marked the highest number of Syrian casualties since the Israel Defense Forces (IDF) began operating in the area nearly four months ago.\n\nThe targeted area was once controlled by a radical Islamic State affiliate, according to the Israeli military.\n\nEarlier Tuesday,\n\nthe Israeli Air Force\n\nconducted additional strikes deeper inside Syria, hitting military infrastructure at the T4 and Tadmur airbases. The Israeli military said the strikes targeted “military capabilities” that had been monitored in recent weeks and were linked to the Assad regime. The airbases have previously been used by Iranian forces, with the approval of Syrian President Bashar Assad.\n\nThe latest strike followed an earlier operation over the weekend in which Israeli jets targeted remaining strategic assets at the same airfields. Israeli officials said the operations were part of a broader effort to maintain air superiority and prevent a renewed military buildup in Syria.\n\n:\n\n|\n\n:\n\nIsrael has intensified military activity in Syria since the collapse of the Assad regime in December. Israeli forces have moved into the Syrian side of the buffer zone, including parts of Mount Hermon. Prime Minister Benjamin Netanyahu and Defense Minister Israel Katz have called for the full demilitarization of the area south of Damascus.\n\nSome Israeli strikes have also aimed to prevent the entrenchment of Palestinian militant factions in Syria, particularly under the\n\ncountry’s new jihadist leadership headed by Ahmad al-Sharaa\n\n.\n\n|\n\n|\n\n|\n\n>>",
        "main_image": {
            "original_url": "https://ynet-pic1.yit.co.il/cdn-cgi/image/format=auto/picserver6/crop_images/2024/12/08/SJgmx11y7Ekg/SJgmx11y7Ekg_177_0_2667_2000_0_x-large.jpg",
            "local_path": "/article-images/israeli-airstrike-kills-gunmen-in-cross-border-fir-4.jpg"
        },
        "content_images": []
    },
    {
        "url": "https://www.ynetnews.com/article/ry4b1glpke",
        "title": "IDF unmasks eliminated Al Jazeera journalist as Hamas terrorist",
        "description": "Military's targeted strike on Hossam Shabat, a Hamas sniper masquerading as an Al Jazeera journalist, comes following incriminating documents showing he was part of terror group's battalion",
        "content": "The IDF and Shin Bet on Tuesday. confirmed the elimination of Hamas operative Hossam Shabat,\n\nwho worked as a journalist for Al Jazeera\n\nand had millions of social media followers.\n\nIn an official statement, the military revealed that Shabat was \"a sniper terrorist from the Beit Hanoun Battalion of the Hamas terrorist organization, who cynically posed as an\n\nAl-Jazeera\n\njournalist.\"\n\n\"In October 2024, the IDF and ISA exposed the terrorist's direct affiliation with the military wing of the Hamas terrorist organization. Internal Hamas documents were revealed proving that he participated in military training conducted by the Beit Hanoun Battalion of Hamas in 2019,\" the statement added.\n\n:\n\n|\n\n:\n\n\"During the war, Hossam carried out terrorist attacks against IDF troops and Israeli civilians. This is additional proof of Hamas terrorists affiliation to the Al-Jazeera network,\" according to the IDF.\n\nThe IDF's words come following Palestinian\n\nreports of Shabat's death on Monday, which detailed an attack on a World Food Program warehouse in northwestern Gaza Cit\n\ny and Shabat's elimination. He had been reporting from northern Gaza in the wake of the collapse of the ceasefire between Israel and Hamas and the IDF's continued operations in the Strip.\n\n|\n\n|\n\n|\n\n>>",
        "main_image": {
            "original_url": "https://ynet-pic1.yit.co.il/cdn-cgi/image/format=auto/picserver6/crop_images/2025/03/25/S1o8zglpJe/S1o8zglpJe_12_980_534_301_0_x-large.jpg",
            "local_path": "/article-images/idf-unmasks-eliminated-al-jazeera-journalist-as-ha-4.jpg"
        },
        "content_images": []
    },
    {
        "url": "https://www.ynetnews.com/article/skxkm1xtjl#autoplay",
        "title": "Where is Hezam al-Asad? Houthi official behind Hebrew anti-Israel posts vanishes",
        "description": "Senior member of Yemeni rebels' Supreme Political Council goes silent after months of daily activity in support of Gaza amid extensive US bombing campaign across Yemen, raising questions about his whereabouts",
        "content": "Where has Hezam al-Asad, a senior member of the Houthi Supreme Political Council, gone? Since the start of the war, the Houthi official had been highly active on the X social media platform, frequently posting videos in support of the Gaza Strip, echoing the words of Houthi leader Abdul Malik al-Houthi, and publishing a steady stream of anti-Israel content. His posts that drew the most attention in Israel were those written in Hebrew.\n\nYet in recent days, despite\n\ncontinued U.S. airstrikes on Yemen\n\nand the Houthis’ own\n\nfiring of ballistic missiles at Israel\n\n, al-Asad has gone silent. Has he gone underground? Or vanished for another reason?\n\nHis last post on X was Thursday, March 20. In it, he wrote in Hebrew: “Death to Israel.” Since then, nothing. This is despite his reputation as an exceptionally active voice online, regularly posting multiple times a day and commenting on every development related to the fighting in Gaza and other conflict zones.\n\nThe Houthis have suffered heavy losses in recent days, both in casualties and property, from U.S. strikes targeting their facilities. But the identities and number of casualties remain unclear.\n\nOn Monday, Saudi news outlet Al Hadath reported, citing sources, that a senior Houthi figure was killed in a strike in the Yemeni capital Sanaa. The area was sealed off for over six hours, and security was tightened.\n\nThe report also said that the target was a government compound and that Houthi leader Abdul Malik al-Houthi had ordered all senior officials and their aides to stop carrying mobile phones amid the renewed strikes. According to the sources, “Houthi leaders disappeared after the renewed U.S. strikes, and confusion reigns in areas under their control.”\n\nThat night, the Houthi Health Ministry reported one civilian killed and 13 others wounded—including three children—in a U.S. strike on a residential building in Sanaa. The ministry blamed the U.S., the international community and humanitarian organizations for the “political and moral responsibility” for attacks on civilian infrastructure and neighborhoods. Houthi-affiliated Al-Masirah TV aired footage showing damage from the strike.\n\n:\n\n|\n\n:\n\n>>\n\nLater Monday, reports emerged of additional strikes in Yemen’s Saada province. According to Yemeni media, recent American strikes have hit multiple regions, including Saada, Sanaa, Marib, Hodeidah, al-Bayda and al-Jawf.\n\nOn Saturday, Al Hadath reported that Houthi naval commander Mansour al-Saadi, call sign Abu Sajad, and seven others were wounded in a previous U.S. strike on a naval base in Hodeidah. On March 16, the outlet reported the death of Abdul Malik al-Houthi’s personal security chief in a strike on Saada. That same day, Houthi sources reported at least 53 killed and around 100 wounded in U.S. airstrikes. The attacks have continued since then. On Wednesday, Houthi-aligned media outlets reported funerals held in Sanaa for 16 fighters.\n\nHezam al-Asad’s X account has over 117,000 followers, and he had gained notoriety during the war for posts—including in Hebrew—about Houthi missile attacks, often mentioning the southern Israeli resort town Eilat by name.\n\nOn the day he went silent last week, he mocked Prime Minister Benjamin Netanyahu for seeking shelter as air raid sirens were triggered in Jerusalem due to a ballistic missile fired from Yemen. “Netanyahu flees like a rat to the bunker. Our army strikes the enemy with God’s power, and the victory of Gaza’s children is near!” he wrote.\n\n|\n\n|\n\n|\n\n>>",
        "main_image": {
            "original_url": "https://ynet-pic1.yit.co.il/cdn-cgi/image/format=auto/picserver6/crop_images/2024/12/26/SkA6HqqHke/SkA6HqqHke_0_0_400_400_0_x-large.jpg",
            "local_path": "/article-images/where-is-hezam-al-asad-houthi-official-behind-hebr-4.jpg"
        },
        "content_images": []
    }
]